# Table of Contents
 <p><div class="lev1"><a href="#Import-pandas,-numpy,-matplotlib-and-seaborn"><span class="toc-item-num">1&nbsp;&nbsp;</span>Import pandas, numpy, matplotlib and seaborn</a></div><div class="lev1"><a href="#Create-a-Series-object,-access-it's-index-and-cells"><span class="toc-item-num">2&nbsp;&nbsp;</span>Create a Series object, access it's index and cells</a></div><div class="lev1"><a href="#Create-a-DataFrame-object,-access-its-rows,-columns,-indices,-cells"><span class="toc-item-num">3&nbsp;&nbsp;</span>Create a DataFrame object, access its rows, columns, indices, cells</a></div><div class="lev1"><a href="#Data-Import"><span class="toc-item-num">4&nbsp;&nbsp;</span>Data Import</a></div><div class="lev1"><a href="#DataFrame-filtering"><span class="toc-item-num">5&nbsp;&nbsp;</span>DataFrame filtering</a></div><div class="lev1"><a href="#Data-export"><span class="toc-item-num">6&nbsp;&nbsp;</span>Data export</a></div><div class="lev1"><a href="#DataFrame-aggregation"><span class="toc-item-num">7&nbsp;&nbsp;</span>DataFrame aggregation</a></div><div class="lev1"><a href="#Data-Merging"><span class="toc-item-num">8&nbsp;&nbsp;</span>Data Merging</a></div>

This notebook is to quickly repeat the most basic pandas operations prior to starting the practical course.
You should be able to quickly perform the following tasks before you start working on the exercises in the Day1 notebook. If you need to look up, how certain problems can be solved, have a look at the pandas [10 Minutes Introduction](http://pandas.pydata.org/pandas-docs/stable/10min.html), the [tutorials](http://pandas.pydata.org/pandas-docs/stable/tutorials.html) and the lecture slides.

# Import pandas, numpy, matplotlib and seaborn

In [36]:
import pandas as pd
import numpy as np
import matplotlib
import matplotlib.pyplot as plt
import seaborn as sns

# Create a Series object, access it's index and cells

Create a Series object representing the following measurements

| S   |
|-----|
| 1.0 |
| 1.5 |
| 3.0 |
| 4.3 |
| 8.2 |

In [10]:
 s = pd.Series([1.0,1.5,3.0,4.3,8.2])

In [11]:
s

0    1.0
1    1.5
2    3.0
3    4.3
4    8.2
dtype: float64

# Create a DataFrame object, access its rows, columns, indices, cells

Create a dataframe of the following table.

|index   |a |b  |c   |d          |e |
|--------|--|---|----|-----------|--|
|1       |2 |3  |5.  |horse      |13|
|2       |3 |1  |1.4 |cat        |11|
|3       |4 |9  |1.2 |dog        |  |
|4       |5 |12 |0.8 |tortoise   |  |
|5       |6 |2  |2.3 |rabbit     |9 |

Now
* access the values of each row individually
* access single cells
* print the index and column names
* access values of each column individually
* rename columns
* extract rows 2-4 as new dataframe
* obtain summary table of dataframe

In [52]:
df = pd.DataFrame({'a': [2,3,4,5,6],
                   'b': [3,1,9,12,2],
                   'c': [5,1.4,1.2,0.8,2.3],
                  'd':["horse","cat","dog","tortoise","rabbit"],
                  'e': [13,11,np.nan,np.nan,9]},
                 index= [1,2,3,4,5])

Create the data frame with pd.DataFrame() function.

In [53]:
df

   a   b    c         d     e
1  2   3  5.0     horse  13.0
2  3   1  1.4       cat  11.0
3  4   9  1.2       dog   NaN
4  5  12  0.8  tortoise   NaN
5  6   2  2.3    rabbit   9.0

Print the data frame

In [54]:
df["c"]

1    5.0
2    1.4
3    1.2
4    0.8
5    2.3
Name: c, dtype: float64

Print the column with the label 'c'

Access third row of first column.

In [78]:
df.loc[2,'a']

3

Print the index and the columns of the data frame:

In [76]:
df.index
df.columns

Int64Index([1, 2, 3, 4, 5], dtype='int64')

Access values of 2nd column:

In [87]:
df.loc[:,"b"]

1     3
2     1
3     9
4    12
5     2
Name: b, dtype: int64

Rename the columns:

In [91]:
df.columns = ['alpha','beta','gamma','delta','epsilon']
df

   alpha  beta  gamma     delta  epsilon
1      2     3    5.0     horse     13.0
2      3     1    1.4       cat     11.0
3      4     9    1.2       dog      NaN
4      5    12    0.8  tortoise      NaN
5      6     2    2.3    rabbit      9.0

Extract single rows as a new data frame:

In [93]:
df1 = df.loc[2:4]
df1

   alpha  beta  gamma     delta  epsilon
2      3     1    1.4       cat     11.0
3      4     9    1.2       dog      NaN
4      5    12    0.8  tortoise      NaN

Finally a summary table can be printed with the describe function

In [100]:
df.describe()

          alpha       beta     gamma  epsilon
count  5.000000   5.000000  5.000000      3.0
mean   4.000000   5.400000  2.140000     11.0
std    1.581139   4.827007  1.690562      2.0
min    2.000000   1.000000  0.800000      9.0
25%    3.000000   2.000000  1.200000      NaN
50%    4.000000   3.000000  1.400000      NaN
75%    5.000000   9.000000  2.300000      NaN
max    6.000000  12.000000  5.000000     13.0

# Data Import

Import the example data from the csv file located in the example folder.

In [105]:
df2 = pd.read_csv('../example_data/example_df.csv')

In [107]:
df2

   a   b    c         d     e
0  2   3  5.0     horse  13.0
1  3   1  1.4       cat  11.0
2  4   9  1.2       dog   NaN
3  5  12  0.8  tortoise   NaN
4  6   2  2.3    rabbit   9.0

Import the following file into a dataframe _df2_:

https://raw.githubusercontent.com/cschaerfe/PIBI/master/example_data/example_df.csv?token=AC7j1EQvTFcnGxOxN0s7SKGaZbaw-AEhks5X4VAvwA%3D%3D

Now import the following file into a pandas dataframe _df3_. Do you need to change some parameters of the funtion?
Check whether import makes sense by showing the dataframe

https://raw.githubusercontent.com/cschaerfe/PIBI/master/example_data/example_df2.csv?token=AC7j1IqAY5PTE1Iadona7kkl6e6Fs4Krks5X4VOIwA%3D%3D

Read in the second example from the folder but change the seperator to a semicolon this time

In [199]:
df3 = pd.read_csv('../example_data/example_df2.csv',sep=';')

In [200]:
df3

   a   b    c         d     e
0  2   3  5.0     horse  13.0
1  3   1  1.4       cat  11.0
2  4   9  1.2       dog   NaN
3  5  12  0.8  tortoise   NaN
4  6   2  2.3    rabbit   9.0

# DataFrame filtering
Using the dataframe created in section 3:

* select rows containing values greater than 2 in the 3rd column
* select rows that contain values greater than 2 in the 3rd column or 'cat' in the 4th column
* drop rows with missing data
* drop duplicate rows
* drop 1st column from dataframe
* sort rows by 2nd column
* convert Strings in 4th column to title-case

At first the rows that have values greater than 2 in the 3rd column are selected

In [155]:
df3[df3.c > 2]

   a  b    c       d     e
0  2  3  5.0   horse  13.0
4  6  2  2.3  rabbit   9.0

Rows with values greater than 2 in the 3rd column plus the rows with 'cat' in hte fourth column

In [156]:
df3[(df3.c > 2) | (df3.d == 'cat')]

   a  b    c       d     e
0  2  3  5.0   horse  13.0
1  3  1  1.4     cat  11.0
4  6  2  2.3  rabbit   9.0

Drow any row that contains missing data:

In [212]:
df3 = df3.dropna(how='any')

Duplicate rows can be dropped using the drop_duplicates() function:

In [213]:
df3 = df3.drop_duplicates()

In [214]:
df3 = df3.drop('a',1)

Use the sort_values() function to sort the data frame by the 2nd column:

In [215]:
df3 =  df3.sort_values(by='b')

In [201]:
df3['d'] = df3['d'].str.upper()

In [216]:
df3

   b    c       d     e
1  1  1.4     CAT  11.0
4  2  2.3  RABBIT   9.0
0  3  5.0   HORSE  13.0

# Data export

Export your filtered dataframe as a text file separated by tabs omitting the index column.

In [228]:
 df3.to_csv('dataframe3_filtered.csv',index=0,sep=' ')

# DataFrame aggregation

Using _df4_, group the data by column 'b'. Test different ways of aggregating the remaining columns as shown in the lecture.

In [271]:
df4 = pd.read_csv('../example_data/df4.csv')

In [272]:
df4

         b    c         d     e
0   mammal  5.0     horse  13.0
1   mammal  1.4       cat  11.0
2   mammal  1.2       dog   NaN
3     fish  0.1  goldfish   NaN
4  reptile  2.3     snake   9.0
5     fish  1.8       koi  10.0
6     fish  0.8      carp   NaN

In [273]:
df5 = df4.groupby('b')

In [275]:
df5.agg(np.max)

           c      d     e
b
fish     1.8    koi  10.0
mammal   5.0  horse  13.0
reptile  2.3  snake   9.0

In [274]:
df5.agg(np.mean)

                c     e
b
fish     0.900000  10.0
mammal   2.533333  12.0
reptile  2.300000   9.0

# Data Merging

* Merge df3 with df4 on columns c, d and e. Change columns with same names in a meaningful way.

In [296]:
df3 = pd.read_csv('../example_data/example_df2.csv',sep=';')
df3

   a   b    c         d     e
0  2   3  5.0     horse  13.0
1  3   1  1.4       cat  11.0
2  4   9  1.2       dog   NaN
3  5  12  0.8  tortoise   NaN
4  6   2  2.3    rabbit   9.0

In [285]:
df4

         b    c         d     e
0   mammal  5.0     horse  13.0
1   mammal  1.4       cat  11.0
2   mammal  1.2       dog   NaN
3     fish  0.1  goldfish   NaN
4  reptile  2.3     snake   9.0
5     fish  1.8       koi  10.0
6     fish  0.8      carp   NaN

* Now perform a full outer join of the data, to keep all rows contained in either of the two dataframes.

In [301]:
dfmerge = pd.merge(df3,df4,on=['c','d','e'])

In [302]:
dfmerge

   a  b_x    c      d     e     b_y
0  2    3  5.0  horse  13.0  mammal
1  3    1  1.4    cat  11.0  mammal
2  4    9  1.2    dog   NaN  mammal

In [305]:
dfmerge2 = pd.merge(df3,df4,on=['c','d','e'],how='outer')

In [306]:
dfmerge2

     a   b_x    c         d     e      b_y
0  2.0   3.0  5.0     horse  13.0   mammal
1  3.0   1.0  1.4       cat  11.0   mammal
2  4.0   9.0  1.2       dog   NaN   mammal
3  5.0  12.0  0.8  tortoise   NaN      NaN
4  6.0   2.0  2.3    rabbit   9.0      NaN
5  NaN   NaN  0.1  goldfish   NaN     fish
6  NaN   NaN  2.3     snake   9.0  reptile
7  NaN   NaN  1.8       koi  10.0     fish
8  NaN   NaN  0.8      carp   NaN     fish